
#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ОчиститьВсеПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьВсеПоля();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьОсобенностиУчета(Команда)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ТекстСообщения = "Укажите номенклатуру!";
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеНоменклатурыСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНоменклатурыСервер()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	               |	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры,
	               |	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	               |	ВидыНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчета1,
	               |	ВидыНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры1
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ПРАВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	               |		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
	
		НоменклатураОсобенностьУчета = Выборка.ОсобенностьУчета;
		НоменклатураТипНоменклатуры  = Выборка.ВидНоменклатуры;	
		
		ВидНоменклатурыОсобенностьУчета = Выборка.ОсобенностьУчета1;
		ВидНоменклатурыТипНоменклатуры	 = Выборка.ТипНоменклатуры1;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьВсеПоля()
	
	НоменклатураОсобенностьУчета = Неопределено;
	НоменклатураТипНоменклатуры  = Неопределено;
	НоменклатураВидНоменклатуры  = Неопределено;	

	ВидНоменклатурыОсобенностьУчета = Неопределено;
	ВидНоменклатурыТипНоменклатуры	 = Неопределено;
	
КонецПроцедуры

#КонецОбласти
